{"items":
[
{"commentvalue":"Our class was very productive this semester.  Each student trained on all aspects of the broadcasting process.  We worked together in teams and found success while helping each other.  We grew as broadcasters and gained friendships along the way. CJ did well this term.  He focused on his daily lessons and asked questions when he needed help.  I hope he continues to practice his filmmaking and enjoying the process.","student_dcid":2801,"storecode":"S2","section_dcid":27399,"teacher_dcid":445}
{"commentvalue":"This quarter we continued our exploration of the basics of photography and image editing.  We practiced the art of photography on real world  photo walks around campus.  A variety of image editing software, both online and off, were explored to help us create interesting images.  Camera skills such as shutter speed, aperture and composition were practiced.  We also exhibited our work in the show \"Through our Eyes\". CJ worked hard at improving his photography and editing skills.  CJ is always friendly to his classmates and participated in all activities.  I hope that CJ continues to enjoy the art of photography in the future. Good job!","student_dcid":2801,"storecode":"S1","section_dcid":27396,"teacher_dcid":445}
{"commentvalue":"CJ has had a good finish to the semester in PE. During the semester we have completed units in badminton, basketball, health and a shortened on floor hockey. CJ has a good level of skill and understanding of the various units that we have completed.  He understands that physical activity and fitness is important, and needs to continue to work on these things both in and out of the PE class. Keep working hard CJ and have a fantastic break!","student_dcid":2801,"storecode":"S1","section_dcid":27367,"teacher_dcid":455}
{"commentvalue":"During second semester in PE, the students finished up the unit on volleyball and then completed sections of invasion team sports, hand-eye coordination softball, games and movement and also a swimming unit. CJ shows a lot of potential in PE but has had an inconsistent year so far. He has demonstrated some basic motor skills but more focus and motivation is needed for him to advance these further. To improve CJ will need to come to class with a positive attitude, changed and ready to engage in the lesson ahead. his results are a reflection of his effort and attitude not ability.","student_dcid":2801,"storecode":"S2","section_dcid":27367,"teacher_dcid":455}
{"commentvalue":"During Q4 we started Personalized Learning. This project is based on the idea that the students take ownership of their learning and find self-guided ways to show that they met the required standards.\nCJ’s topic was Transportation and technology that enhances different means of transportation. For research he looked at different factories. His writing doesn’t follow the initial topic and it doesn’t seem that he writes about anything new that he might have learned. CJ would have done much better if he followed closely the given directions and sat away from friends. Please work on No Red Ink over the summer.","student_dcid":2801,"storecode":"S2","section_dcid":31210,"teacher_dcid":671}
{"commentvalue":"The second quarter focused on reading. The whole class read the novel “Among the Hidden”. The practiced skills were reading comprehension and finding textual evidence. The students annotated the story while reading. Through the writing assignment, the students demonstrated their understanding of the plot and of the character’s traits and feeling. As a higher level activity, they had to write interview questions and answers for a “shadow child” and come up with appropriate answers to the question: What are the pros and cons of having a third child law?\nCJ, I encourage you to put more effort in your work and take the given feedback to improve.","student_dcid":2801,"storecode":"S1","section_dcid":31210,"teacher_dcid":671}
{"commentvalue":"For second quarter, students learned about the history of Thailand. They had an opportunity to make Krathong from banana leaves on Loy Krathong day. Thai alphabets and Thai numbers were also introduced. \nCJ. actively participates and enjoys activities in Thai class. He has learned new vocabularies in Thai. He always completes class assignments in a timely manners.","student_dcid":2801,"storecode":"S1","section_dcid":27202,"teacher_dcid":918}
{"commentvalue":"For fourth quarter, students learned different topics about language and culture. They applied vocabulary through dialogues and telephone conversations. Moreover, Khon which is a traditional Thai dance was introduced to students and they got a chance to practice Khon dance with Khon teacher in the high school. \nCJ participates well in Thai class. He has a good attitude towards learning Thai. However, he needs to be more prepared for the exam.  It’s been my pleasure to have him in my class.","student_dcid":2801,"storecode":"S2","section_dcid":27202,"teacher_dcid":918}
{"commentvalue":"In science this semester, students explored \n physical science and life science using researching, engineering, and science skills to learn about these domains.  The students completed a variety of projects to understand the science of cooking, where our materials come from, and how to help an ecosystem.\n\nCJ has demonstrated a really great attitude and he has also demonstrated an ability to consistently meet the grade level expectations for academics.  CJ has been an active participant and brings a lot of vitality to the class discussions.  Also, he provides a good model for the rest of the class.","student_dcid":2801,"storecode":"S2","section_dcid":27330,"teacher_dcid":2659}
{"commentvalue":"C.J. excels at constructing accurate linguistic, nonlinguistic, and physical models of scientific concepts. Additionally she is exceeding expectations of applying understanding of science concepts to develop logical and effective design for engineering projects. Lastly I have observed that she is developing clear diagrams that help to visualize designs for proposed solutions to engineering projects.","student_dcid":2801,"storecode":"S1","section_dcid":27330,"teacher_dcid":2659}
{"commentvalue":"In advisory this quarter, students participated in a variety activities that covered a range of topics such as, procrastination, conflict resolution, sleep hygiene, advice for being successful in middle school, and preparing for summer.","student_dcid":2801,"storecode":"S2","section_dcid":27219,"teacher_dcid":2983}
{"commentvalue":"This class focused on geometric concepts and statistical probability. CJ is a capable student but could be pushing himself a bit more in class.  He solves real-world mathematical problems involving geometric concepts effectively. I have noticed that CJ can improve on staying focused in class when asked to word independently He is a respectful, honest student but I'd like to see a greater commitment to not being satisfied with meeting the expectations.  In conclusion,  CJ can succeed next year in math with a refocus on class engagement and being productive.","student_dcid":2801,"storecode":"S2","section_dcid":27260,"teacher_dcid":2983}
{"commentvalue":"This quarter focused on digital citizenship. The students learned about cyberbullying laws in Thailand and what they can do to keep themselves safe, and to help prevent it.\n\nI've really enjoyed having CJ in my advisory class. He has brought art and creativity to our class with his video art and fun diving stores! He has attacked these social issues and provides valuable insight.","student_dcid":2801,"storecode":"S1","section_dcid":27219,"teacher_dcid":2983}
{"commentvalue":"This semester in Pre-Algebra we studied the number system and have been mastering the theory behind creating and solving equations or  inequalities given real world scenarios.\n\nCJ has improved his behavior and work ethic since the beginning of the year. He struggles sometimes with the concepts but does an ok job asking questions. I encourage him to continue to cultivate the habit of completing his work and focusing on being the best student he can be.","student_dcid":2801,"storecode":"S1","section_dcid":27260,"teacher_dcid":2983}
{"commentvalue":"Social Studies in quarter four was mostly focused on the economics aspects of entrepreneurship with the Shark Tank project. Students evaluated the social impacts of a material in their Impact Report and wrote mission statements. \n\nCJ identifies the negative impact his material-cotton has on the environment and the positive impact cotton has on the society. In the end, he was able to explain why his group should continue to use cotton.","student_dcid":2801,"storecode":"S2","section_dcid":27342,"teacher_dcid":2986}
{"commentvalue":"This quarter, students learned about five major world religions.  They focused on their beliefs, rituals, texts, appeal, and development, with an emphasis on finding commonalities among religions while also recognizing differences. Within this, students also looked out how religions spread or did not spread both in the past and present. \nCJ can identify multiple characteristics of the religions we have studied. However, he struggles with describing\/ explaining them, making connections and being able to go a step further to compare and contrast them. CJ, make sure that when given the opportunity to improve your work, you take it.","student_dcid":2801,"storecode":"S1","section_dcid":27342,"teacher_dcid":2986}
{"commentvalue":"This quarter we focused on research skills. We did this by researching how to make our product for Shark Tank and then by researching the environmental and social impact our materials have. Students also learned how to correctly cite their research. \n\nCJ took the opportunity to revise his impact report. He made some changes which demonstrate that he has used three sources for his report, and he came up with answers to the given research question. He understands how to do in text citation and a Works Cited list. We encourage CJ to continue reading in English and practice his grammar skills over the summer.","student_dcid":2801,"storecode":"S2","section_dcid":27246,"teacher_dcid":2986}
{"commentvalue":"This quarter, students focused on reading and writing poetry and how it can be used to express identity.  They learned different poetic devices and looked at how they impact the mood and tone of a poem. They practiced these skills, along with comprehension , while reading, writing and annotating poetry.  \nCJ did an awesome job on his poetry portfolio. His hard work staying focused in class paid off and he wrote some amazing poems and annotated very well! \nHe needs to continue working on his English, especially tense, plural vs. singular and subject verb agreement. He should be very proud of his progress this quarter.","student_dcid":2801,"storecode":"S1","section_dcid":27246,"teacher_dcid":2986}
{"commentvalue":"CJ actively  participates in classroom discussions and other activities. When focused he can completes assignments and projects on time. Shows willingness and readiness to learn and discover more about the Bible and the life of Jesus.","student_dcid":2801,"storecode":"S1","section_dcid":31055,"teacher_dcid":3185}
{"commentvalue":"shows efforts and develops consistency in all that he does especially during classroom discussions and shares his ideas willingly particularly on The ten Commandments and sacraments.","student_dcid":2801,"storecode":"S2","section_dcid":31055,"teacher_dcid":3185}
]}